Repository: GE-Developer/VOID
Catalog: VOID/Resources/Localizable.xcstrings
Source language: en
Languages: ar, az, be, bn, ca, cs, da, de, el, es, fi, fr, he, hi, hr, hu, hy, id, is, it, ja, ka, kk, ko, ky, ms, nb, nl, pl, pt, ro, ru, sk, sv, th, tr, uk, vi, zh_hans, zh_hant

# AboutAES256.fourthDescription
source: 1 - You enter a password. 2 - You select VOID. 3 - The application generates a salt and combines it with the password and VOID. 4 - Argon2id computes the key using the specified parameters. 5 - The key is used in AES-256 to encrypt the text. 6 - The salt and other parameters are stored in the encrypted structure. **To decrypt, you must exactly reproduce the same key — enter the same password and VOID and have the original ciphertext accurate to the character**.
ar: 1 - تُدخل كلمة المرور. 2 - تختار VOID. 3 - يُنشئ التطبيق ملحاً ويدمجه مع كلمة المرور وVOID. 4 - تحسب Argon2id المفتاح باستخدام المعاملات المحددة. 5 - يُستخدم المفتاح في AES-256 لتشفير النص. 6 - يُخزَّن الملح والمعاملات الأخرى في البنية المشفرة. **لفك التشفير، يجب إعادة إنشاء نفس المفتاح تماماً — أدخل نفس كلمة المرور وVOID واحتفظ بالنص المشفر الأصلي حرفاً بحرف**.
az: 1 - Şifrə daxil edirsiniz. 2 - VOID seçirsiniz. 3 - Tətbiq salt yaradır və onu şifrə və VOID ilə birləşdirir. 4 - Argon2id verilən parametrlərlə açarı hesablayır. 5 - Açar AES-256-da mətnin şifrələnməsi üçün istifadə olunur. 6 - Salt və digər parametrlər şifrələnmiş struktura yazılır. **Deşifrə üçün eyni açarı dəqiq şəkildə təkrarlamalısınız — eyni şifrəni və VOID-i daxil edin və orijinal şifrələnmiş mətni son simvoladək doğru saxlayın.**
be: 1 - Вы ўводзіце пароль. 2 - Вы выбіраеце VOID. 3 - Праграма стварае соль і аб'ядноўвае яе з паролем і VOID. 4 - Argon2id вылічвае ключ з выкарыстаннем зададзеных параметраў. 5 - Ключ выкарыстоўваецца ў AES-256 для шыфравання тэксту. 6 - Соль і іншыя параметры захоўваюцца ў зашыфраванай структуры. **Для расшыфроўкі неабходна дакладна ўзнавіць той жа ключ — увесці той жа пароль і VOID і мець зыходны зашыфраваны тэкст дакладна да сімвала**.
bn: 1 - আপনি পাসওয়ার্ড দিন। 2 - আপনি VOID নির্বাচন করুন। 3 - অ্যাপ্লিকেশন একটি সল্ট তৈরি করে এবং পাসওয়ার্ড ও VOID-এর সাথে মিশিয়ে দেয়। 4 - Argon2id নির্দিষ্ট প্যারামিটার ব্যবহার করে কী গণনা করে। 5 - কীটি AES-256-এ টেক্সট এনক্রিপ্ট করতে ব্যবহৃত হয়। 6 - সল্ট এবং অন্যান্য প্যারামিটার এনক্রিপ্টেড কাঠামোতে সংরক্ষিত হয়। **ডিক্রিপ্ট করতে একই কী হুবহু পুনরুৎপাদন করতে হবে — একই পাসওয়ার্ড ও VOID দিতে হবে এবং মূল সাইফারটেক্সট অক্ষরে অক্ষরে সঠিক রাখতে হবে**।
ca: 1 - Introdueixes una contrasenya. 2 - Selecciones VOID. 3 - L'aplicació genera una sal i la combina amb la contrasenya i VOID. 4 - Argon2id calcula la clau amb els paràmetres especificats. 5 - La clau s'utilitza en AES-256 per xifrar el text. 6 - La sal i la resta de paràmetres s'emmagatzemen dins de l'estructura xifrada. **Per desxifrar, has de reproduir exactament la mateixa clau — introdueix la mateixa contrasenya i VOID i conserva el text xifrat original exacte fins al darrer caràcter**.
cs: 1 - Zadáte heslo. 2 - Vyberete VOID. 3 - Aplikace vygeneruje sůl a zkombinuje ji s heslem a VOIDem. 4 - Argon2id vypočítá klíč podle zadaných parametrů. 5 - Klíč se použije v AES-256 k zašifrování textu. 6 - Sůl a ostatní parametry se uloží do šifrované struktury. **Pro dešifrování musíte přesně znovu vytvořit stejný klíč — zadejte stejné heslo i VOID a zachovejte původní šifrovaný text přesně do znaku**.
da: 1 - Du indtaster en adgangskode. 2 - Du vælger VOID. 3 - Appen genererer en salt og kombinerer den med adgangskoden og VOID. 4 - Argon2id beregner nøglen med de angivne parametre. 5 - Nøglen bruges i AES-256 til at kryptere teksten. 6 - Salt og øvrige parametre gemmes i den krypterede struktur. **For at dekryptere skal du genskabe præcis den samme nøgle — indtast den samme adgangskode og VOID, og sørg for, at den oprindelige chiffertekst er nøjagtig ned til det enkelte tegn**.
de: 1 - Du gibst ein Passwort ein. 2 - Du wählst VOID. 3 - Die App erzeugt ein Salt und kombiniert es mit dem Passwort und VOID. 4 - Argon2id berechnet den Schlüssel anhand der angegebenen Parameter. 5 - Der Schlüssel wird in AES-256 verwendet, um den Text zu verschlüsseln. 6 - Salt und andere Parameter werden in der verschlüsselten Struktur gespeichert. **Zum Entschlüsseln musst du genau denselben Schlüssel reproduzieren — gib dasselbe Passwort und VOID ein und halte den ursprünglichen Ciphertext zeichengetreu bereit.**
el: 1 - Εισάγετε έναν κωδικό πρόσβασης. 2 - Επιλέγετε το VOID. 3 - Η εφαρμογή δημιουργεί ένα salt και το συνδυάζει με τον κωδικό πρόσβασης και το VOID. 4 - Το Argon2id υπολογίζει το κλειδί με τις καθορισμένες παραμέτρους. 5 - Το κλειδί χρησιμοποιείται στο AES-256 για την κρυπτογράφηση του κειμένου. 6 - Το salt και οι υπόλοιπες παράμετροι αποθηκεύονται στην κρυπτογραφημένη δομή. **Για να γίνει η αποκρυπτογράφηση, πρέπει να αναπαράγετε ακριβώς το ίδιο κλειδί — εισαγάγετε τον ίδιο κωδικό πρόσβασης και VOID και κρατήστε το αρχικό κρυπτοκείμενο ακριβές μέχρι και τον τελευταίο χαρακτήρα**.
es: 1 - Introduces una contraseña. 2 - Seleccionas VOID. 3 - La aplicación genera una sal y la combina con la contraseña y VOID. 4 - Argon2id calcula la clave usando los parámetros especificados. 5 - La clave se usa en AES-256 para cifrar el texto. 6 - La sal y el resto de parámetros se guardan en la estructura cifrada. **Para descifrar, debes reproducir exactamente la misma clave: introducir la misma contraseña y VOID y disponer del texto cifrado original con precisión de un carácter**.
fi: 1 - Syötät salasanan. 2 - Valitset VOIDin. 3 - Sovellus generoi suolan ja yhdistää sen salasanaan ja VOIDiin. 4 - Argon2id laskee avaimen annetuilla parametreilla. 5 - Avain käytetään AES-256:ssa tekstin salaamiseen. 6 - Suola ja muut parametrit tallennetaan salattuun rakenteeseen. **Purkamista varten sinun on toistettava täsmälleen sama avain — syötä sama salasana ja VOID ja säilytä alkuperäinen salattu teksti tarkkana merkilleen**.
fr: 1 - Vous saisissez un mot de passe. 2 - Vous choisissez VOID. 3 - L'application génère un sel et le combine avec le mot de passe et VOID. 4 - Argon2id calcule la clé avec les paramètres indiqués. 5 - La clé est utilisée par AES-256 pour chiffrer le texte. 6 - Le sel et les autres paramètres sont enregistrés dans la structure chiffrée. **Pour déchiffrer, vous devez reproduire exactement la même clé — saisir le même mot de passe et VOID, et disposer du texte chiffré original, à l'identique**.
he: 1 - אתה מזין סיסמה. 2 - אתה בוחר VOID. 3 - האפליקציה מייצרת מלח ומשלבת אותו עם הסיסמה ו-VOID. 4 - Argon2id מחשב את המפתח לפי הפרמטרים שנקבעו. 5 - המפתח משמש ב-AES-256 להצפנת הטקסט. 6 - המלח ופרמטרים נוספים נשמרים במבנה המוצפן. **לפענוח, עליך לשחזר את אותו המפתח בדיוק — להזין את אותה סיסמה ו-VOID ולהחזיק את הטקסט המוצפן המקורי מדויק עד לתו**.
hi: 1 - आप पासवर्ड दर्ज करते हैं। 2 - आप VOID चुनते हैं। 3 - एप्लिकेशन एक सॉल्ट उत्पन्न करता है और उसे पासवर्ड और VOID के साथ जोड़ता है। 4 - Argon2id निर्दिष्ट पैरामीटरों का उपयोग करके कुंजी की गणना करता है। 5 - AES-256 उसी कुंजी से पाठ को एन्क्रिप्ट करता है। 6 - सॉल्ट और अन्य पैरामीटर एन्क्रिप्टेड संरचना में सहेजे जाते हैं। **डिक्रिप्ट करने के लिए आपको वही कुंजी दोबारा बनानी होगी — वही पासवर्ड और VOID दर्ज करें और मूल सिफरतंत्र को अक्षर-दर-अक्षर सही रखें।**
hr: 1 - Unesete lozinku. 2 - Odaberete VOID. 3 - Aplikacija generira sol i kombinira je s lozinkom i VOID-om. 4 - Argon2id izračunava ključ prema zadanim parametrima. 5 - Ključ se koristi u AES-256 za šifriranje teksta. 6 - Sol i ostali parametri pohranjuju se u šifriranoj strukturi. **Za dešifriranje morate točno reproducirati isti ključ — unesite istu lozinku i VOID te zadržite izvorni šifrat precizan do znaka**.
hu: 1 - Megadsz egy jelszót. 2 - Kiválasztod a VOID-ot. 3 - Az alkalmazás sót generál, és a jelszóval, valamint a VOID-dal kombinálja. 4 - Az Argon2id a megadott paraméterekkel kiszámítja a kulcsot. 5 - A kulcsot az AES-256 használja a szöveg titkosítására. 6 - A sót és a többi paramétert a titkosított struktúrában tároljuk. **A visszafejtéshez pontosan ugyanazt a kulcsot kell újra előállítanod — add meg ugyanazt a jelszót és VOID-ot, és őrizd meg a teljes eredeti titkosított szöveget karakterpontossággal.**
hy: 1 - Դուք մուտքագրում եք գաղտնաբառը. 2 - Դուք ընտրում եք VOID-ը. 3 - Հավելվածը ստեղծում է salt և միացնում այն գաղտնաբառին ու VOID-ին. 4 - Argon2id-ը նշված պարամետրերով հաշվարկում է բանալին. 5 - Բանալին օգտագործվում է AES-256-ում տեքստը կոդավորելու համար. 6 - Salt-ը և մյուս պարամետրերը պահպանվում են կոդավորված կառուցվածքում. **Ապակոդավորման համար պետք է ճշգրիտ կրկնել նույն բանալին — մուտքագրեք նույն գաղտնաբառը և VOID-ը և պահեք բնօրինակ կոդավորված տեքստը մինչև վերջին նիշը.**
id: 1 - Anda memasukkan kata sandi. 2 - Anda memilih VOID. 3 - Aplikasi membuat salt dan menggabungkannya dengan kata sandi serta VOID. 4 - Argon2id menghitung kunci menggunakan parameter yang ditentukan. 5 - Kunci digunakan oleh AES-256 untuk mengenkripsi teks. 6 - Salt dan parameter lainnya disimpan di struktur terenkripsi. **Untuk mendekripsi, Anda harus mereproduksi kunci yang sama persis — masukkan kata sandi dan VOID yang sama serta pastikan ciphertext asli tetap akurat hingga karakter terakhir.**
is: 1 - Þú slærð inn lykilorð. 2 - Þú velur VOID. 3 - Forritið býr til salt og sameinar það við lykilorðið og VOID. 4 - Argon2id reiknar út lykilinn með skilgreindum breytum. 5 - Lykillinn er notaður í AES-256 til að dulrita textann. 6 - Salt og aðrar breytur eru vistaðar í dulritaðri uppbyggingu. **Til að afkóða þarftu að endurgera nákvæmlega sama lykil — sláðu inn sama lykilorð og VOID og hafðu upprunalega dulritaða textann réttan niður í síðasta staf.**
it: 1 - Inserisci una password. 2 - Selezioni VOID. 3 - L'app genera un sale e lo combina con la password e Void. 4 - Argon2id calcola la chiave con i parametri specificati. 5 - La chiave viene utilizzata in AES-256 per cifrare il testo. 6 - Il sale e gli altri parametri vengono salvati nella struttura cifrata. **Per decifrare devi riprodurre esattamente la stessa chiave — inserire la stessa password e VOID e avere il testo cifrato originale, preciso al carattere**.
ja: 1 - パスワードを入力します。 2 - VOID を選択します。 3 - アプリがソルトを生成し、パスワードと VOID を組み合わせます。 4 - Argon2id が指定されたパラメータで鍵を計算します。 5 - その鍵を使用して AES-256 がテキストを暗号化します。 6 - ソルトとその他のパラメータが暗号化された構造に保存されます。 **復号するには同じ鍵を正確に再現する必要があります — 同じパスワードと VOID を入力し、元の暗号文を一文字も欠けずに揃えてください。**
ka: 1 — შეიყვანეთ პაროლი. 2 — აირჩიეთ VOID. 3 — აპლიკაცია ქმნის მარილს და აერთიანებს მას პაროლთან და VOID-თან. 4 — Argon2id გამოთვლის გასაღები კოდის მითითებული პარამეტრებით. 5 — გასაღები კოდი გამოიყენება AES-256-ში ტექსტის დასაშიფრად. 6 — მარილი და სხვა პარამეტრები ინახება შიფრირებულ სტრუქტურაში. **დეშიფრაციისთვის უნდა მიიღოთ ზუსტად იგივე გასაღები კოდი — შეიყვანეთ ისევ პაროლი და VOID და გქონდეთ საწყისი შიფრტექსტი სიმბოლო-სიმბოლომდე ზუსტად**.
kk: 1 - Сіз құпия сөзді енгізесіз. 2 - Сіз VOID таңдайсыз. 3 - Қолданба тұз жасайды және оны құпия сөзбен және VOID-мен біріктіреді. 4 - Argon2id көрсетілген параметрлерді пайдаланып кілтті есептейді. 5 - Кілт мәтінді шифрлау үшін AES-256-да пайдаланылады. 6 - Тұз және басқа параметрлер шифрланған құрылымда сақталады. **Шифрды шешу үшін дәл сол кілтті қайта жасау керек — сол құпия сөзді және VOID-ді енгізіп, бастапқы шифрмәтінді таңба-таңба дәл болуын қамтамасыз ету керек**.
ko: 1 - 비밀번호를 입력합니다。 2 - VOID를 선택합니다。 3 - 앱이 솔트를 생성해 비밀번호와 VOID와 결합합니다。 4 - Argon2id가 지정한 매개변수로 키를 계산합니다。 5 - 해당 키를 사용해 AES-256으로 텍스트를 암호화합니다。 6 - 솔트와 다른 매개변수가 암호화된 구조에 저장됩니다。 **복호화를 위해서는 동일한 키를 정확히 재현해야 합니다 — 동일한 비밀번호와 VOID를 입력하고, 원본 암호문을 글자 하나까지 정확히 보관해야 합니다。**
ky: 1 - Сырсөзүңүздү киргизесиз. 2 - VOID тандайсыз. 3 - Колдонмо туз жаратат жана аны сырсөз жана VOID менен бириктирет. 4 - Argon2id көрсөтүлгөн параметрлерди колдонуп ачкычты эсептейт. 5 - Ачкыч текстти шифрлөө үчүн AES-256 де колдонулат. 6 - Туз жана башка параметрлер шифрленген структурада сакталат. **Шифрди чечүү үчүн так ошол ачкычты кайра жаратуу керек — ошол эле сырсөздү жана VOID ди киргизип, баштапкы шифрмәтін белги-белгиге чейин так болушун камсыз кылуу керек**.
ms: 1 - Anda memasukkan kata laluan. 2 - Anda memilih VOID. 3 - Aplikasi menjana garam dan menggabungkannya dengan kata laluan serta VOID. 4 - Argon2id mengira kunci menggunakan parameter yang ditentukan. 5 - Kunci digunakan dalam AES-256 untuk menyulitkan teks. 6 - Garam dan parameter lain disimpan dalam struktur tersulit. **Untuk menyahsulit, anda mesti menghasilkan semula kunci yang sama tepat — masukkan kata laluan dan VOID yang sama serta pastikan teks sifer asal kekal tepat hingga ke aksara terakhir.**
nb: 1 - Du skriver inn et passord. 2 - Du velger VOID. 3 - Appen genererer et salt og kombinerer det med passordet og VOID. 4 - Argon2id beregner nøkkelen med de angitte parameterne. 5 - Nøkkelen brukes av AES-256 til å kryptere teksten. 6 - Saltet og de andre parameterne lagres i den krypterte strukturen. **For å dekryptere må du gjenskape akkurat den samme nøkkelen — skriv inn det samme passordet og VOID, og sørg for at den opprinnelige chifferteksten er nøyaktig ned til siste tegn.**
nl: 1 - Je voert een wachtwoord in. 2 - Je selecteert VOID. 3 - De app genereert een salt en combineert deze met het wachtwoord en VOID. 4 - Argon2id berekent de sleutel met de opgegeven parameters. 5 - De sleutel wordt in AES-256 gebruikt om de tekst te versleutelen. 6 - De salt en andere parameters worden opgeslagen in de versleutelde structuur. **Om te ontsleutelen moet je exact dezelfde sleutel reproduceren — voer hetzelfde wachtwoord en VOID in en zorg dat de oorspronkelijke ciphertext teken voor teken klopt.**
pl: 1 - Wprowadzasz hasło. 2 - Wybierasz VOID. 3 - Aplikacja generuje sól i łączy ją z hasłem oraz VOID-em. 4 - Argon2id oblicza klucz przy użyciu określonych parametrów. 5 - Klucz jest używany w AES-256 do zaszyfrowania tekstu. 6 - Sól i pozostałe parametry są przechowywane w zaszyfrowanej strukturze. **Aby odszyfrować, musisz odtworzyć dokładnie ten sam klucz — wprowadź to samo hasło i VOID oraz zachowaj oryginalny tekst zaszyfrowany bezbłędnie co do znaku.**
pt: 1 - Você insere uma senha. 2 - Você seleciona o VOID. 3 - O aplicativo gera um sal e o combina com a senha e o VOID. 4 - O Argon2id calcula a chave usando os parâmetros especificados. 5 - A chave é usada no AES-256 para criptografar o texto. 6 - O sal e os demais parâmetros são armazenados na estrutura criptografada. **Para descriptografar, você precisa reproduzir exatamente a mesma chave — inserir a mesma senha e VOID e ter o texto cifrado original correto caractere por caractere.**
ro: 1 - Introduci o parolă. 2 - Alegi VOID. 3 - Aplicația generează un salt și îl combină cu parola și VOID. 4 - Argon2id calculează cheia folosind parametrii specificați. 5 - Cheia este utilizată în AES-256 pentru a cripta textul. 6 - Saltul și ceilalți parametri sunt stocați în structura criptată. **Pentru a decripta trebuie să reproduci exact aceeași cheie — introdu aceeași parolă și VOID și păstrează textul criptat original fidel până la ultimul caracter.**
ru: 1 - Вы вводите пароль. 2 - Выбираете VOID. 3 - Приложение генерирует соль и объединяет её с паролем и VOID. 4 - Argon2id вычисляет ключ с заданными параметрами. 5 - Ключ используется в AES‑256 для шифрования текста. 6 - Соль и остальные параметры сохраняются в зашифрованной структуре. **Для расшифровки нужно точно воспроизвести тот же ключ — ввести тот же пароль и VOID и иметь оригинальный шифротекст с точностью до символа**.
sk: 1 - Zadáš heslo. 2 - Vyberieš VOID. 3 - Aplikácia vytvorí soľ a spojí ju s heslom a VOID-om. 4 - Argon2id vypočíta kľúč podľa zadaných parametrov. 5 - Kľúč sa použije v AES-256 na šifrovanie textu. 6 - Soľ a ostatné parametre sa uložia do šifrovanej štruktúry. **Na dešifrovanie musíš presne zreprodukovať ten istý kľúč — zadaj to isté heslo a VOID a zachovaj pôvodný šifrovaný text presne do posledného znaku.**
sv: 1 - Du anger ett lösenord. 2 - Du väljer VOID. 3 - Appen genererar ett salt och kombinerar det med lösenordet och VOID. 4 - Argon2id beräknar nyckeln med de angivna parametrarna. 5 - Nyckeln används i AES-256 för att kryptera texten. 6 - Saltet och andra parametrar lagras i den krypterade strukturen. **För att dekryptera måste du exakt återskapa samma nyckel — ange samma lösenord och VOID och ha den ursprungliga chiffertexten exakt tecken för tecken.**
th: 1 - คุณป้อนรหัสผ่าน. 2 - คุณเลือก VOID. 3 - แอปสร้าง salt และผสานกับรหัสผ่านและ VOID. 4 - Argon2id คำนวณคีย์โดยใช้พารามิเตอร์ที่กำหนด. 5 - คีย์ถูกใช้ใน AES-256 เพื่อเข้ารหัสข้อความ. 6 - salt และพารามิเตอร์อื่นๆ ถูกเก็บไว้ในโครงสร้างที่เข้ารหัส. **เพื่อถอดรหัส คุณต้องสร้างคีย์เดียวกันอย่างแม่นยำ — ป้อนรหัสผ่านและ VOID เดียวกัน และต้องมี ciphertext ต้นฉบับที่ถูกต้องทุกตัวอักษร**.
tr: 1 - Bir parola girersiniz. 2 - VOID seçersiniz. 3 - Uygulama bir salt üretir ve onu parolayla ve VOID ile birleştirir. 4 - Argon2id belirtilen parametrelerle anahtarı hesaplar. 5 - Anahtar, AES-256 içinde metni şifrelemek için kullanılır. 6 - Salt ve diğer parametreler şifreli yapıda saklanır. **Çözmek için aynı anahtarı birebir yeniden üretmeniz gerekir — aynı parolayı ve VOID'i girin ve orijinal şifreli metni harfi harfine elinizde bulundurun.**
uk: 1 — Ви вводите пароль. 2 — Обираєте VOID. 3 — Додаток генерує сіль і об'єднує її з паролем та VOID. 4 — Argon2id обчислює ключ за заданими параметрами. 5 — Ключ використовується в AES-256 для шифрування тексту. 6 — Сіль та інші параметри зберігаються в зашифрованій структурі. **Щоб розшифрувати, потрібно точно відтворити той самий ключ — ввести той самий пароль і VOID та мати початковий шифротекст без жодної помилки**.
vi: 1 - Bạn nhập mật khẩu. 2 - Bạn chọn VOID. 3 - Ứng dụng tạo muối và kết hợp muối với mật khẩu cùng VOID. 4 - Argon2id tính toán khóa bằng các tham số đã chọn. 5 - Khóa được dùng trong AES-256 để mã hóa văn bản. 6 - Muối và các tham số khác được lưu trong cấu trúc đã mã hóa. **Để giải mã, bạn phải tái tạo chính xác cùng khóa — nhập cùng mật khẩu và VOID, đồng thời giữ nguyên bản mã gốc từng ký tự.**
zh_hans: 1 - 输入密码。 2 - 选择 VOID。 3 - 应用生成盐值，并将其与密码和 VOID 组合。 4 - Argon2id 使用指定的参数计算密钥。 5 - 使用该密钥在 AES-256 中加密文本。 6 - 盐值和其他参数会存储在加密结构中。 **要解密，必须完全复现同一密钥—输入相同的密码和 VOID，并确保原始密文准确无误。**
zh_hant: 1 - 輸入密碼。 2 - 選擇 VOID。 3 - 應用生成鹽值，並將其與密碼和 VOID 組合。 4 - Argon2id 使用指定的引數計算金鑰。 5 - 使用該金鑰在 AES-256 中加密文字。 6 - 鹽值和其他引數會儲存在加密結構中。 **要解密，必須完全復現同一金鑰——輸入相同的密碼和 VOID，並確保原始密文準確無誤。**

# AboutAES256.fourthTitle
source: How AES-256 + Argon2id + VOID Works
ar: كيف يعمل AES-256 + Argon2id + VOID
az: AES-256 + Argon2id + VOID necə işləyir
be: Як працуе AES-256 + Argon2id + VOID
bn: AES-256 + Argon2id + VOID কিভাবে কাজ করে
ca: Com funciona AES-256 + Argon2id + VOID
cs: Jak funguje AES-256 + Argon2id + VOID
da: Sådan virker AES-256 + Argon2id + VOID
de: So funktioniert AES-256 + Argon2id + VOID
el: Πώς λειτουργεί το AES-256 + Argon2id + VOID
es: Cómo funciona AES-256 + Argon2id + VOID
fi: Miten AES-256 + Argon2id + VOID toimii
fr: Fonctionnement d'AES-256 + Argon2id + VOID
he: כיצד עובד AES-256 + Argon2id + VOID
hi: AES-256 + Argon2id + VOID कैसे काम करता है
hr: Kako funkcionira AES-256 + Argon2id + VOID
hu: Hogyan működik az AES-256 + Argon2id + VOID
hy: Ինչպես է աշխատում AES-256 + Argon2id + VOID
id: Cara Kerja AES-256 + Argon2id + VOID
is: Hvernig AES-256 + Argon2id + VOID virkar
it: Come funziona AES-256 + Argon2id + VOID
ja: AES-256 + Argon2id + VOID の仕組み
ka: როგორ მუშაობს AES-256 + Argon2id + VOID
kk: AES-256 + Argon2id + VOID қалай жұмыс істейді
ko: AES-256 + Argon2id + VOID 작동 방식
ky: AES-256 + Argon2id + VOID кантип иштейт
ms: Cara Kerja AES-256 + Argon2id + VOID
nb: Hvordan AES-256 + Argon2id + VOID fungerer
nl: Hoe AES-256 + Argon2id + VOID werkt
pl: Jak działa AES-256 + Argon2id + VOID
pt: Como funciona o AES-256 + Argon2id + VOID
ro: Cum funcționează AES-256 + Argon2id + VOID
ru: Как работает AES-256 + Argon2id + VOID
sk: Ako funguje AES-256 + Argon2id + VOID
sv: Så fungerar AES-256 + Argon2id + VOID
th: การทำงานของ AES-256 + Argon2id + VOID
tr: AES-256 + Argon2id + VOID nasıl çalışır
uk: Як працює AES-256 + Argon2id + VOID
vi: Cách AES-256 + Argon2id + VOID hoạt động
zh_hans: AES-256 + Argon2id + VOID 的工作原理
zh_hant: AES-256 + Argon2id + VOID 的工作原理
